programming/c/notes/types.org
#+title: types
#+options: ^:nil num:nil author:nil email:nil creator:nil timestamp:nil

* int

The type int means that the variables listed are integers; 

The range of both int and float depends on the machine you are using;
16-bits int s, which lie between -32768 and +32767, are common, as are
32-bit int s.

* float

float, which means floating point, i.e., numbers that may have a
fractional part.  

A float number is typically a 32-bit quantity, with at least six
significant digits and magnitude generally between about 10^{-38} and
10^{38} .

C provides several other data types besides int and float, including:

| char   | character - a single byte       |
| short  | short integer                   |
| long   | long integer                    |
| double | double-precision floating point |
