programming/c/notes/types.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>types</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">types</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org4817dc0">int</a></li>
<li><a href="#org04a7181">float</a></li>
</ul>
</div>
</div>

<div id="outline-container-org4817dc0" class="outline-2">
<h2 id="org4817dc0">int</h2>
<div class="outline-text-2" id="text-org4817dc0">
<p>
The type int means that the variables listed are integers; 
</p>

<p>
The range of both int and float depends on the machine you are using;
16-bits int s, which lie between -32768 and +32767, are common, as are
32-bit int s.
</p>
</div>
</div>

<div id="outline-container-org04a7181" class="outline-2">
<h2 id="org04a7181">float</h2>
<div class="outline-text-2" id="text-org04a7181">
<p>
float, which means floating point, i.e., numbers that may have a
fractional part.  
</p>

<p>
A float number is typically a 32-bit quantity, with at least six
significant digits and magnitude generally between about 10^{-38} and
10^{38} .
</p>

<p>
C provides several other data types besides int and float, including:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">char</td>
<td class="org-left">character - a single byte</td>
</tr>

<tr>
<td class="org-left">short</td>
<td class="org-left">short integer</td>
</tr>

<tr>
<td class="org-left">long</td>
<td class="org-left">long integer</td>
</tr>

<tr>
<td class="org-left">double</td>
<td class="org-left">double-precision floating point</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"></p>
</div>
</body>
</html>
